erpdev.СХК_Расширение/src/DataProcessors/СХК_ОтправкаОтчетов/СХК_ОтправкаОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СХК_ОтправкаОтчетов</name>
</mdclass:DataProcessor>

erpdev.СХК_Расширение/src/AccumulationRegisters/ВыручкаИСебестоимостьПродаж/ВыручкаИСебестоимостьПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="cc9cedf1-410d-414a-a05f-f167b8908470">
  <name>ВыручкаИСебестоимостьПродаж</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <registerType>Turnovers</registerType>
  <resources extendedConfigurationObject="edd9691b-b496-451a-a788-235f34120109">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="4504d8d2-02f7-422b-8c29-e0883636ad98">
    <name>СуммаВыручки</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="d0e7cb79-659d-45e4-a529-c894e4fa01ab">
    <name>ПостатейныеПеременныеУпр</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="0b442828-1c11-4ce9-98f3-01707a795884">
    <name>СтоимостьЗабалансовая</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="a1d92ebe-e703-442e-ae17-bb35719a01ad">
    <name>ПостатейныеПеременныеСНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="d5850dff-58fa-4e75-80b9-ee9c34e16865">
    <name>СтоимостьУпр</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="20028c7f-7ddf-4a18-818f-54aecef63bd1">
    <name>ДопРасходыУпр</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="81c4428b-ec37-4c06-a1a6-b55886f980f7">
    <name>СуммаВыручкиСНДСРегл</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="ee81f54b-e33c-44d3-bca4-1979b279a78f">
    <name>ВременнаяРазница</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="551c3cc6-c1c9-4ec6-90ed-def5afaa58fa">
    <name>РезервПодОбесценениеРегл</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="4d8c59a7-85b4-4c9d-9f30-bfd66d2ea1c5">
    <name>Стоимость</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="db7a0438-d3cb-4318-99d5-03bf8a12e605">
    <name>ДопРасходы</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="b480ee1c-6147-4390-a5b4-f7da34d553a3">
    <name>ДопРасходыБезНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="89f0005c-52e6-4e62-bdf6-366952676779">
    <name>РасходыНаПродажуУпр</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="cd564ee4-a847-44c6-8e1c-f25c90db733f">
    <name>РасходыНаПродажуБезНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="3b7cced8-db06-41c2-8634-0d19a2fd203b">
    <name>ПостатейныеПеременныеРегл</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="791fb719-bbb4-4eb4-b6f3-53bf000b859a">
    <name>СтоимостьРегл</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="2fbafb19-6ca1-43fa-85d2-6a4c87d42eb3">
    <name>СуммаВыручкиБезНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="9d0454cc-268b-4614-9e5d-f3c0ee507af1">
    <name>СтоимостьБезНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="fb6fba8d-452a-447a-a8bd-b5cd17f50e1b">
    <name>ТрудозатратыРегл</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="8fe31c8d-0ded-4f3d-9d11-da1deae029b2">
    <name>СуммаВыручкиРегл</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="056a7ca2-8496-491c-9c1c-00cbad024ed7">
    <name>РасходыНаПродажуСНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="e64364a2-11b2-400d-929b-f7e521ca74d8">
    <name>ПостатейныеПостоянныеРегл</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="2d901ca2-210a-406f-8407-7bb2bdc0ffec">
    <name>Трудозатраты</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="3c35dbd5-ff82-463c-9811-4558ecb00884">
    <name>ПостатейныеПостоянныеСНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="a216a2d6-0987-44dc-801f-be89309d851f">
    <name>ПостатейныеПостоянныеБезНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="a1fb2217-df24-404a-baa2-db0c70971dd9">
    <name>ПостатейныеПеременныеБезНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="94259154-4525-4528-afea-f2a828c8ba7b">
    <name>СтоимостьЗабалансоваяРегл</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="d9ccb891-7a26-4518-b3bf-05a990da6c78">
    <name>ДопРасходыРегл</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="ccaa816c-cfd9-477d-8349-e266a1533cae">
    <name>ТрудозатратыУпр</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="2b11cdc5-2716-4995-8510-28c3f7f068f1">
    <name>ПостатейныеПостоянныеУпр</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="748054ce-4417-46c0-80b9-0828357d4a7e">
    <name>РасходыНаПродажуРегл</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="a6fe42e9-6184-4006-97fb-8fb52eeb16ba">
    <name>РезервПодОбесценениеУпр</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="64867008-b82f-4766-9f7d-c90f8062e8db">
    <name>ПостояннаяРазница</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="0a9e3369-58e3-4c83-b8cd-5487a863fc55">
    <name>СуммаРучнойСкидки</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="deef8deb-2b93-4d66-9f52-a1f9a28a4efe">
    <name>СуммаАвтоматическойСкидки</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="d7909ada-b68a-403e-9860-51de800bc036">
    <name>ВалютаВзаиморасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4576c9c6-68ce-46ab-a192-2718b8390b04">
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4f8729e5-bc47-41c5-a309-3e40069138a7">
    <name>СуммаВВалютеВзаиморасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1aefd2fd-2457-4711-873e-b8642ada9a2a">
    <name>СуммаБезНДСВВалютеВзаиморасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2727a882-5207-4a0d-aefd-42668a8adb73">
    <name>ВалютаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="32777412-5843-413a-9db5-e3fdb94e3741">
    <name>СуммаВВалютеДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dbc559fb-5646-4900-bf18-859f73fb5a9e">
    <name>СуммаБезНДСВВалютеДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="70d5cbd6-5cd1-437b-b5f7-d143fa157d93">
    <name>ИсточникГФУНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="71fe3d1a-9339-4758-bd8c-85591dfc1ef8">
    <name>ИсточникГФУРасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4452edfd-375f-45d5-bec3-1776210d4bef">
    <name>ДокументДвижения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7d67a2b2-06fb-4ef8-a361-e6573db19922">
    <name>РасчетПартий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0da81f44-49da-4ebf-94a6-d1eaa410871b">
    <name>РасчетСебестоимости</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="adbf37db-f8a7-40a1-be8d-8ae3f66f51dd">
    <name>РасчетНеЗавершен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f7d3840c-cada-4e3c-889a-777f6099c3d8">
    <name>НастройкаХозяйственнойОперации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="09494088-18d3-4ea7-91a5-f13178e0853c">
    <name>ИдентификаторФинЗаписи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="150bcd3d-5fe1-460a-82d6-e65c66da3290">
    <name>ДокументРасчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="abed7941-37c3-420c-84a9-1874b6cf6245">
    <name>РежимЗакрытияМесяца</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="36edc4c5-c363-4d53-8496-0551fd7ad696">
    <name>Сторно</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="7eadb439-cbf2-4e6a-9022-fc66b8de8d58">
    <name>АналитикаУчетаНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="cf1201fe-569c-4901-85d3-29da5aa53077">
    <name>АналитикаУчетаПоПартнерам</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="c2e1c88d-cdf5-48bf-9615-3bd4ec44b646">
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="9c966579-d355-4e6a-bd83-150dfc936345">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="0a7bda21-39d9-43d0-a358-8431a3757203">
    <name>АналитикаУчетаПартий</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="cadb4ea8-1ff0-41ef-8d30-a8e0e3fa2780">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="76d9c27f-a066-45ee-8646-a029deff4e99">
    <name>ЗаказКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="91c78e8b-9661-4eab-9ec5-bd2bd9f567fb">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="e0bb1e5a-7014-4cbe-81bc-9d7cc9c9d05c">
    <name>ТипЗапасов</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="924018c6-a69a-4ec9-ac19-6837426e8364">
    <name>ВидЗапасов</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="0d619327-114b-4796-a50d-d3dc86dad60e">
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="3cf7c49d-9baa-4df1-8e8c-7c637c2cdaf4">
    <name>РазделУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="a5e9fff7-057a-42a9-81e9-1335240572b7">
    <name>Партия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="0969ae24-0372-4d39-ad1d-7ce44508d67e">
    <name>АналитикаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="8c107abb-b863-4690-91b3-601f53c4e488">
    <name>ВидДеятельностиНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="39dff5de-8734-4206-b6c3-2587d83e025a">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="4e4c85a4-985a-4ad6-bbb2-4c0cf68f0204">
    <name>НаправлениеДеятельностиКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="341c833f-1023-43ca-81fe-0978de5da736">
    <name>НаправлениеДеятельностиНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

erpdev.СХК_Расширение/src/DataProcessors/СХК_ОтправкаОтчетов/Forms/Форма/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()
	ДокументРезультат=новый ТабличныйДокумент();
	
	СКД=Отчеты.МаркетингПродажи.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	Настройки=СКД.НастройкиПоУмолчанию;
	ДатаНачала=Настройки.ПараметрыДанных.Элементы.Найти("ДатаНачала");
	ДатаНачала.Значение=НачалоМесяца(ТекущаяДата());
	ДатаОкончания=Настройки.ПараметрыДанных.Элементы.Найти("ДатаОкончания");
	ДатаОкончания.Значение=КонецДня(ТекущаяДата());
 
	 	Расшифровка = Новый ДанныеРасшифровкиКомпоновкиДанных;
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;    
		
        //Передаем в макет компоновки схему, настройки и данные расшифровки
        МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, Настройки, Расшифровка);    
        ВнешниеПараметры = Новый Структура;    
		
        //Выполним компоновку с помощью процессора компоновки
        ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		
		ТаблицаВеб = НаборВеб(ДатаНачала,ДатаОкончания);
		//
		ВнешниеНаборыДанных = Новый Структура("ТаблицаВеб", ТаблицаВеб);

        ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,ВнешниеНаборыДанных, Расшифровка);    
		
        //Выводим результат в табличный документ
        ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
        ПроцессорВывода.УстановитьДокумент(ДокументРезультат);    
        ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);    	 
		
		ДокументРезультат.Записать("c:\temp\моржа.xls",ТипФайлаТабличногоДокумента.XLS);

КонецПроцедуры

&НаСервере
Функция НаборВеб(ДатаНачала,ДатаОкончания)  
	
	
	//ДатаНачала = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ДатаНачала"); 
	//ДатаОкончания = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ДатаОкончания"); 
	 
	//
	

	Таб = Новый ТаблицаЗначений; 
	//Таб.Колонки.Добавить("День");
	Таб.Колонки.Добавить("Бренд");
	Таб.Колонки.Добавить("Номенклатура");  
	Таб.Колонки.Добавить("СуммаВыручки");
	Таб.Колонки.Добавить("КоличествоПродано");   
	Таб.Колонки.Добавить("Канал");
	Таб.Колонки.Добавить("КаналНаменование"); 
	Таб.Колонки.Добавить("ЗаказКлиента");
	Таб.Колонки.Добавить("Партнер");
	//Таб.Колонки.Добавить("ПКатегория");


	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
|	ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот КАК КоличествоОборот,
|	ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот КАК СуммаВыручкиОборот,
|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура.Марка КАК АналитикаУчетаНоменклатурыНоменклатураМарка,
|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура КАК АналитикаУчетаНоменклатурыНоменклатура,
|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Партнер КАК АналитикаУчетаПоПартнерамПартнер
|ИЗ
|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты КАК ВыручкаИСебестоимостьПродажОбороты
|ГДЕ
|	ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания"; 
	Запрос.УстановитьПараметр("ДатаНачала",ДатаНачала.Значение);
	Запрос.УстановитьПараметр("ДатаОкончания",ДатаОкончания.Значение);
	//Запрос.УстановитьПараметр("Сторно",Ложь); 
	//Запрос.УстановитьПараметр("ХозяйственнаяОперация",Перечисления.ХозяйственныеОперации.СторноРеализации);  
	//Запрос.УстановитьПараметр("ХозяйственнаяОперация2",Перечисления.ХозяйственныеОперации.ВозвратТоваровОтКлиентаПрошлыхПериодов);
	//Запрос.УстановитьПараметр("ЗаказКлиента",Тип("ДокументСсылка.ЗаказКлиента"));
	Рез = Запрос.Выполнить().Выбрать();

	//Пока Рез.Следующий() Цикл
	//	Сообщить(Рез.АналитикаУчетаПоПартнерамПартнер.ДополнительныеРеквизиты[2].Значение.Наименование);	
	//	
	//КонецЦикла;
	
	
	 
	
	//ТабИтог = Новый ТаблицаЗначений; 
	//ТабИтог.Колонки.Добавить("Онлайн");
	//ТабИтог.Колонки.Добавить("Офлайн");  
	//
	//Результат = Запрос.Выполнить().Выбрать();
	//Пока Результат.Следующий() Цикл
	//	Попытка
	//		Если Результат.АналитикаУчетаПоПартнерамПартнер.ДополнительныеРеквизиты[2].Значение.Наименование <> "" Тогда  
	//			Т = ТабИтог.Добавить();
	//			Если Результат.АналитикаУчетаПоПартнерамПартнер.ДополнительныеРеквизиты[2].Значение.Наименование = "E.comerce" Тогда
	//				Т.Онлайн = Результат.СуммаВыручкиОборот ; 
	//			Иначе
	//				Т.Офлайн = Результат.СуммаВыручкиОборот ;	
	//			КонецЕсли;
	//		КонецЕсли;
	//	Исключение
	//	КонецПопытки;
	//КонецЦикла;   
	////
	////ВнешниеНаборыДанных = Новый Структура("ТабИтог", ТабИтог);
	//////ВнешниеНаборыДанных.Вставить("ТабИтог", ТабИтог);
	//Онлайн = ТабИтог.Итог("Онлайн"); 
	//Офлайн = ТабИтог.Итог("Офлайн"); 
	//ИтогОнОф = Онлайн + Офлайн;
	//
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		Попытка

		Если Рез.АналитикаУчетаПоПартнерамПартнер.ДополнительныеРеквизиты[2].Значение.Наименование <> "" Тогда
				Т = Таб.Добавить();
		Т.Бренд = Рез.АналитикаУчетаНоменклатурыНоменклатураМарка;   
		Т.Номенклатура = Рез.АналитикаУчетаНоменклатурыНоменклатура ;
		
		Т.СуммаВыручки = Рез.СуммаВыручкиОборот ; 
		Т.КоличествоПродано = Рез.КоличествоОборот ;
		Если Рез.АналитикаУчетаПоПартнерамПартнер.ДополнительныеРеквизиты[2].Значение.Наименование = "E.comerce" Тогда
			Т.Канал = "Онлайн" ;  
			//Т.ПВыручка = Окр(Рез.СуммаВыручкиОборот /Онлайн * 100,2); 
			//Т.ПКатегория =0;//Окр(Рез.СуммаВыручкиОборот /ИтогОнОф * 100,2);

		Иначе
			Т.Канал = "Offline";
			//Т.ПВыручка = Окр(Рез.СуммаВыручкиОборот /Офлайн * 100, 2);
			//Т.ПКатегория = 0;//Окр(Рез.СуммаВыручкиОборот /ИтогОнОф * 100,2);
		КонецЕсли;
		Т.КаналНаменование = Рез.АналитикаУчетаПоПартнерамПартнер.ДополнительныеРеквизиты[2].Значение.Наименование;
		Т.Партнер = Рез.АналитикаУчетаПоПартнерамПартнер;
				
		КонецЕсли;
	Исключение   
		//Сообщить(Рез.ЗаказКлиентаПартнер);
		КонецПопытки;
		//Сообщить(Рез.ЗаказКлиентаПартнер);	
	КонецЦикла;
	
	
	
	Возврат Таб;	
КонецФункции   


&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры
